sloshing/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	interFoam;

startFrom       	startTime;

startTime       	0;

stopAt          	endTime;

endTime         	40;

deltaT          	0.05;

writeControl    	adjustable;

writeInterval   	0.05;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	6;

writeCompression 	off;

timeFormat      	general;

timePrecision   	6;

runTimeModifiable 	yes;

adjustTimeStep  	yes;

maxCo           	0.5;

maxAlphaCo      	0.5;

maxDeltaT       	1.0;

// ************************************************************************* //
